lucasssvaz/arduino-esp32/libraries/BLE/src/impl/nimble/NimBLEClient.h
/*
 * Copyright 2017-2026 Espressif Systems (Shanghai) PTE LTD
 * Copyright 2020-2025 Ryan Powell <ryan@nable-embedded.io> and
 * esp-nimble-cpp, NimBLE-Arduino contributors.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#pragma once

#include "soc/soc_caps.h"
#include "sdkconfig.h"
#if (defined(SOC_BLE_SUPPORTED) || defined(CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE)) && defined(CONFIG_NIMBLE_ENABLED)

#include "BLEClient.h"
#include "NimBLEConnInfo.h"
#include "impl/BLESync.h"

#include <host/ble_hs.h>
#include <host/ble_gap.h>
#include <host/ble_gatt.h>
#include <mutex>
#include <vector>

struct BLEClient::Impl {
  uint16_t connHandle = BLE_HS_CONN_HANDLE_NONE;
  BTAddress peerAddress;
  bool connected = false;
  uint16_t preferredMTU = 0;
  BLESync connectSync;
  std::mutex mtx;

  BLEClient::ConnectHandler onConnectCb;
  BLEClient::DisconnectHandler onDisconnectCb;
  BLEClient::ConnectFailHandler onConnectFailCb;
  BLEClient::MtuChangedHandler onMtuChangedCb;
  BLEClient::ConnParamsReqHandler onConnParamsReqCb;
  BLEClient::IdentityHandler onIdentityCb;

  struct RemoteServiceEntry {
    BLEUUID uuid;
    uint16_t startHandle;
    uint16_t endHandle;
  };
  std::vector<RemoteServiceEntry> discoveredServices;
  BLESync discoverSync;

  static int gapEventHandler(struct ble_gap_event *event, void *arg);
  static int serviceDiscoveryCb(uint16_t connHandle, const struct ble_gatt_error *error,
                                const struct ble_gatt_svc *service, void *arg);
  static int mtuExchangeCb(uint16_t connHandle, const struct ble_gatt_error *error, uint16_t mtu, void *arg);
};

#endif /* (SOC_BLE_SUPPORTED || CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE) && CONFIG_NIMBLE_ENABLED */
